app/controllers/movie_dbs_controller.rb

SELECT "movie_dbs".* FROM "movie_dbs" WHERE "movie_dbs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    grabber = MovieDb.find(params[:id])