app/controllers/mvpage_controller.rb

  def moviegrab
    if params[:movie_breakdown] == "Suspense"
    grabber = MovieDb.find(1)
    elsif params[:movie_breakdown] == "Horror"
      grabber = MovieDb.find(2)
    elsif params[:movie_breakdown] == "Love"
      grabber = MovieDb.find(2)
    elsif params[:movie_breakdown] == "Mystery"
      grabber = MovieDb.find(1)
    elsif params[:movie_breakdown] == "Rated +18"
      grabber = MovieDb.find(2)
    elsif params[:movie_breakdown] == "Sci-Fi"
      grabber = MovieDb.find(3)
---
SELECT "movie_dbs".* FROM "movie_dbs" WHERE "movie_dbs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "movie_dbs".* FROM "movie_dbs" WHERE "movie_dbs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "movie_dbs".* FROM "movie_dbs" WHERE "movie_dbs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]